{"backend": "tensorflow", "keras_version": "2.1.3", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "trainable": true, "dtype": "float32", "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 200, 200, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "bias_constraint": null, "trainable": true, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.5, "name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}